## Staging: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                  |
|--------|---------------------------------------|
| add    | `aws_ecs_task_definition.form_viewer` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_task_definition.form_viewer will be created
  + resource "aws_ecs_task_definition" "form_viewer" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + Command                = null
                  + Cpu                    = 0
                  + CredentialSpecs        = null
                  + DependsOn              = null
                  + DisableNetworking      = null
                  + DnsSearchDomains       = null
                  + DnsServers             = null
                  + DockerLabels           = null
                  + DockerSecurityOptions  = null
                  + EntryPoint             = null
                  + Environment            = [
                      + {
                          + Name  = "AUDIT_LOG_QUEUE_URL"
                          + Value = "https://sqs.ca-central-1.amazonaws.com/687401027353/audit_log_queue"
                        },
                      + {
                          + Name  = "COGNITO_CLIENT_ID"
                          + Value = "17bsg3b2b7q5snon007rru264u"
                        },
                      + {
                          + Name  = "COGNITO_ENDPOINT_URL"
                          + Value = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_Cguq9JNQ1"
                        },
                      + {
                          + Name  = "EMAIL_ADDRESS_CONTACT_US"
                          + Value = "assistance+forms-formulaires@cds-snc.ca"
                        },
                      + {
                          + Name  = "EMAIL_ADDRESS_SUPPORT"
                          + Value = "assistance+forms-formulaires@cds-snc.ca"
                        },
                      + {
                          + Name  = "HOST_URL"
                          + Value = "https://forms-staging.cdssandbox.xyz"
                        },
                      + {
                          + Name  = "METRIC_PROVIDER"
                          + Value = "stdout"
                        },
                      + {
                          + Name  = "NEXTAUTH_URL"
                          + Value = "https://forms-staging.cdssandbox.xyz"
                        },
                      + {
                          + Name  = "RECAPTCHA_V3_SITE_KEY"
                          + Value = "6LfJDN4eAAAAAGvdRF7ZnQ7ciqdo1RQnQDFmh0VY"
                        },
                      + {
                          + Name  = "REDIS_URL"
                          + Value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                      + {
                          + Name  = "RELIABILITY_FILE_STORAGE"
                          + Value = "forms-staging-reliability-file-storage"
                        },
                      + {
                          + Name  = "REPROCESS_SUBMISSION_QUEUE_URL"
                          + Value = "https://sqs.ca-central-1.amazonaws.com/687401027353/reprocess_submission_queue.fifo"
                        },
                      + {
                          + Name  = "TEMPLATE_ID"
                          + Value = "8d597a1b-a1d6-4e3c-8421-042a2b4158b7"
                        },
                      + {
                          + Name  = "TEMPORARY_TOKEN_TEMPLATE_ID"
                          + Value = "b6885d06-d10a-422a-973f-05e274d9aa86"
                        },
                      + {
                          + Name  = "TRACER_PROVIDER"
                          + Value = "stdout"
                        },
                      + {
                          + Name  = "VAULT_FILE_STORAGE"
                          + Value = "forms-staging-vault-file-storage"
                        },
                    ]
                  + EnvironmentFiles       = null
                  + Essential              = true
                  + ExtraHosts             = null
                  + FirelensConfiguration  = null
                  + HealthCheck            = null
                  + Hostname               = null
                  + Image                  = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  + Interactive            = null
                  + Links                  = null
                  + LinuxParameters        = {
                      + Capabilities       = {
                          + Add  = []
                          + Drop = [
                              + "ALL",
                            ]
                        }
                      + Devices            = null
                      + InitProcessEnabled = null
                      + MaxSwap            = null
                      + SharedMemorySize   = null
                      + Swappiness         = null
                      + Tmpfs              = null
                    }
                  + LogConfiguration       = {
                      + LogDriver     = "awslogs"
                      + Options       = {
                          + awslogs-group         = "Forms"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-form-viewer"
                        }
                      + SecretOptions = null
                    }
                  + Memory                 = null
                  + MemoryReservation      = null
                  + MountPoints            = []
                  + Name                   = "form_viewer"
                  + PortMappings           = [
                      + {
                          + AppProtocol        = ""
                          + ContainerPort      = 3000
                          + ContainerPortRange = null
                          + HostPort           = 3000
                          + Name               = null
                          + Protocol           = "tcp"
                        },
                    ]
                  + Privileged             = null
                  + PseudoTerminal         = null
                  + ReadonlyRootFilesystem = null
                  + RepositoryCredentials  = null
                  + ResourceRequirements   = null
                  + Secrets                = [
                      + {
                          + Name      = "DATABASE_URL"
                          + ValueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                      + {
                          + Name      = "FRESHDESK_API_KEY"
                          + ValueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:freshdesk_api_key-JVyxop"
                        },
                      + {
                          + Name      = "GC_NOTIFY_CALLBACK_BEARER_TOKEN"
                          + ValueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_callback_bearer_token-aXJPLs"
                        },
                      + {
                          + Name      = "NOTIFY_API_KEY"
                          + ValueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-eR3nNp"
                        },
                      + {
                          + Name      = "RECAPTCHA_V3_SECRET_KEY"
                          + ValueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:recaptcha_secret-tTjsBo"
                        },
                      + {
                          + Name      = "TOKEN_SECRET"
                          + ValueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:token_secret-n5Doyu"
                        },
                    ]
                  + StartTimeout           = null
                  + StopTimeout            = null
                  + SystemControls         = []
                  + Ulimits                = null
                  + User                   = null
                  + VolumesFrom            = []
                  + WorkingDirectory       = null
                },
            ]
        )
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::687401027353:role/form-viewer"
      + family                   = "form-viewer"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::687401027353:role/form-viewer"
      + track_latest             = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_codedeploy_app.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_codedeploy_deployment_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.codedeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.forms"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
